const state = {
  years: [
    '2007年 (平成元年)',
    '2008年 (平成2年)',
    '2009年 (平成3年)',
    '2010年 (平成4年)',
    '2011年 (平成5年)',
    '2012年 (平成6年)',
    '2013年 (平成7年)',
    '2014年 (平成8年)',
    '2015年 (平成9年)',
    '2016年 (平成10年)',
    '2017年 (平成11年)',
    '2018年 (平成12年)',
    '2019年 (平成13年)',
    '2020年 (平成14年)',
    '2021年 (平成15年)'
  ],
  months: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12],
  days: [
    1,
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13,
    14,
    15,
    16,
    17,
    18,
    19,
    20,
    21,
    22,
    23,
    24,
    25,
    26,
    27,
    28,
    29,
    30,
    31
  ]
};

const getters = {
  years: state => state.years,
  months: state => state.months,
  days: state => state.days
};

export default {
  namespaced: true,
  state,
  getters
};
